In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df= pd.read_csv('online_store_customer_data.csv')
df

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
3,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,1.0,1199.79
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...
2507,5/1/2021,153695,Female,57.0,Single,South Carolina,Platinum,self-employed,Card,0.0,150.10
2508,5/1/2021,153696,Female,36.0,Married,Hawaii,Silver,self-employed,PayPal,1.0,708.88
2509,5/1/2021,153697,Male,22.0,Single,South Carolina,Basic,workers,PayPal,1.0,2030.07
2510,5/1/2021,153698,NaN,44.0,Single,New York,Basic,Employees,PayPal,0.0,1909.77
2511,5/1/2021,153699,Male,48.0,Single,California,Silver,workers,PayPal,1.0,1073.15

In [3]:
df.isnull().sum()

Transaction_date      0
Transaction_ID        0
Gender               28
Age                  42
Marital_status        0
State_names           0
Segment               0
Employees_status     26
Payment_method        0
Referal             155
Amount_spent        242
dtype: int64

In [4]:
df['Gender'].value_counts()

Gender
Female    1356
Male      1128
Name: count, dtype: int64

In [5]:
df['Gender'].replace(np.nan,'Female',inplace=True)

C:\Users\PUSHKAR\AppData\Local\Temp\ipykernel_28392\3652258697.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Gender'].replace(np.nan,'Female',inplace=True)

In [8]:
df['Age'].replace(np.nan,df['Age'].mean(),inplace=True)

C:\Users\PUSHKAR\AppData\Local\Temp\ipykernel_28392\832010488.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].replace(np.nan,df['Age'].mean(),inplace=True)

In [9]:
df.isnull().sum()

Transaction_date      0
Transaction_ID        0
Gender                0
Age                   0
Marital_status        0
State_names           0
Segment               0
Employees_status     26
Payment_method        0
Referal             155
Amount_spent        242
dtype: int64

In [10]:
df['Employees_status'].value_counts()

Employees_status
Employees        946
workers          798
self-employed    487
Unemployment     255
Name: count, dtype: int64

In [11]:
df['Employees_status'].replace(np.nan,'Employees',inplace=True)

C:\Users\PUSHKAR\AppData\Local\Temp\ipykernel_28392\2408902727.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Employees_status'].replace(np.nan,'Employees',inplace=True)

In [13]:
df['Referal'].value_counts()

Referal
1.0    1537
0.0     820
Name: count, dtype: int64

In [14]:
df['Referal'].replace(np.nan,1.0,inplace=True)

C:\Users\PUSHKAR\AppData\Local\Temp\ipykernel_28392\969506098.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Referal'].replace(np.nan,1.0,inplace=True)

In [15]:
df.isnull().sum()

Transaction_date      0
Transaction_ID        0
Gender                0
Age                   0
Marital_status        0
State_names           0
Segment               0
Employees_status      0
Payment_method        0
Referal               0
Amount_spent        242
dtype: int64

In [17]:
df['Amount_spent'].replace(np.nan,df['Amount_spent'].mean(),inplace=True)

C:\Users\PUSHKAR\AppData\Local\Temp\ipykernel_28392\1790230929.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Amount_spent'].replace(np.nan,df['Amount_spent'].mean(),inplace=True)

In [18]:
df.isnull().sum()

Transaction_date    0
Transaction_ID      0
Gender              0
Age                 0
Marital_status      0
State_names         0
Segment             0
Employees_status    0
Payment_method      0
Referal             0
Amount_spent        0
dtype: int64

In [22]:
group = df.groupby('Payment_method')
group

In [24]:
sub_grp = group.get_group('Card')
sub_grp

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.040000
3,1/1/2019,151203,Female,18.0,Single,Virginia,Platinum,workers,Card,1.0,1199.790000
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,1418.422577
8,1/4/2019,151208,Male,75.0,Married,Florida,Silver,Employees,Card,0.0,1046.200000
9,1/4/2019,151209,Female,41.0,Married,Vermont,Gold,Unemployment,Card,1.0,2730.600000
...,...,...,...,...,...,...,...,...,...,...,...
2497,4/28/2021,153685,Female,72.0,Married,South Carolina,Basic,Employees,Card,0.0,982.080000
2499,4/28/2021,153687,Male,33.0,Married,California,Silver,Employees,Card,1.0,2482.850000
2501,4/29/2021,153689,Female,65.0,Single,Nevada,Silver,Unemployment,Card,1.0,1418.422577
2505,4/30/2021,153693,Male,54.0,Married,Alabama,Basic,Employees,Card,0.0,266.610000
2507,5/1/2021,153695,Female,57.0,Single,South Carolina,Platinum,self-employed,Card,0.0,150.100000

In [31]:
group['Age'].agg(['mean','median','sum','min','max','count'])

                     mean  median           sum   min   max  count
Payment_method
Card            46.119579    46.0  34543.564777  15.0  78.0    749
Other           47.444477    48.0  28229.463563  15.0  78.0    595
PayPal          46.558864    47.0  54380.753036  15.0  78.0   1168

In [33]:
age_mean = group['Age'].mean()
age_mean

Payment_method
Card      46.119579
Other     47.444477
PayPal    46.558864
Name: Age, dtype: float64

In [34]:
card_mean = age_mean['Card'].mean()
card_mean

46.11957914195986

C:\Users\PUSHKAR\AppData\Local\Temp\ipykernel_28392\1426904731.py:1: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sub_grp.agg([sum,max,min])
C:\Users\PUSHKAR\AppData\Local\Temp\ipykernel_28392\1426904731.py:1: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sub_grp.agg([sum,max,min])
C:\Users\PUSHKAR\AppData\Local\Temp\ipykernel_28392\1426904731.py:1: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sub_grp.agg([sum,max,min])

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
sum,1/1/20191/1/20191/1/20191/4/20191/4/20191/5/20...,114193811,MaleFemaleMaleMaleFemaleFemaleFemaleFemaleFema...,34543.564777,SingleSingleSingleMarriedMarriedMarriedMarried...,IllinoisVirginiaConnecticutFloridaVermontIowaN...,BasicPlatinumBasicSilverGoldBasicPlatinumBasic...,self-employedworkersself-employedEmployeesUnem...,CardCardCardCardCardCardCardCardCardCardCardCa...,489.0,1.046943e+06
max,9/9/2020,153695,Male,78.000000,Single,Wyoming,Silver,workers,Card,1.0,2.999980e+03
min,1/1/2019,151201,Female,15.000000,Married,Alabama,Basic,Employees,Card,0.0,3.018000e+01

In [40]:
min_value = df['Amount_spent'].min()
max_value = df['Amount_spent'].max()

In [41]:
min_value

2.09

In [42]:
max_value

2999.98

In [43]:
labels = ['small','medium','big']

In [44]:
bins = np.linspace(min_value,max_value,5)
bins

array([2.0900000e+00, 7.5156250e+02, 1.5010350e+03, 2.2505075e+03,
       2.9999800e+03])

In [45]:
df['bins'] = pd.cut(df['Amount_spent'],bins=bins,include_lowest=True)

In [47]:
df['bins_qcut'] = pd.qcut(df['Amount_spent'],labels=labels,q=3,precision=1)

In [48]:
df

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent,bins,bins_qcut
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.360000,"(1501.035, 2250.508]",big
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.040000,"(2.089, 751.562]",small
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.600000,"(1501.035, 2250.508]",medium
3,1/1/2019,151203,Female,18.0,Single,Virginia,Platinum,workers,Card,1.0,1199.790000,"(751.562, 1501.035]",medium
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,1418.422577,"(751.562, 1501.035]",medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2507,5/1/2021,153695,Female,57.0,Single,South Carolina,Platinum,self-employed,Card,0.0,150.100000,"(2.089, 751.562]",small
2508,5/1/2021,153696,Female,36.0,Married,Hawaii,Silver,self-employed,PayPal,1.0,708.880000,"(2.089, 751.562]",small
2509,5/1/2021,153697,Male,22.0,Single,South Carolina,Basic,workers,PayPal,1.0,2030.070000,"(1501.035, 2250.508]",big
2510,5/1/2021,153698,Female,44.0,Single,New York,Basic,Employees,PayPal,0.0,1909.770000,"(1501.035, 2250.508]",big
2511,5/1/2021,153699,Male,48.0,Single,California,Silver,workers,PayPal,1.0,1073.150000,"(751.562, 1501.035]",medium